#include <iostream>

using namespace std;



int main()
{
    setlocale(LC_ALL, "RUS");
    //ДЗ-2=========================================
        int ai, bi;
        cout << "Введите целое число: ";
        cin >> ai;
        cout << endl;
        bi = (ai > 21) ? ai * 2 :  21 - ai;
        cout << "Ответ: " << bi<<endl;
    //===================================================
    //ДЗ-3================================================
    int M[3][3][3] = { {{1,2,3},    {4,5,6},    {7,8,9}},       
                       {{10,11,12}, {13,14,15}, {16,17,18}},    
                       {{19,20,21}, {22,23,24}, {25,26,27}} };  
    int *pM;
    pM = &M[0][0][0];
    
     pM[12] = 100;
     pM[13] = 101;
     pM[14] = 102;
     cout << pM[12]<<" "<< pM[13]<<" "<<pM[14];
     cout<<endl;
     //===================================================
     //ДЗ-4===============================================
     extern  int a;
     extern  int b;
     extern  int c;
     extern  int d;
     float e;
     e = static_cast<float>(a * (b + (c / d)));
     cout << e << endl;
    
    return 0;
}
